app/controllers/hero_powers_controller.rb

    def create
        hero_power = HeroPower.create!(hero_power_params)
---
INSERT INTO "hero_powers" ("strength", "hero_id", "power_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["strength", "Average"], ["hero_id", 3], ["power_id", 1], ["created_at", "2023-03-29 18:03:52.775269"], ["updated_at", "2023-03-29 18:03:52.775269"]]