app/controllers/heroes_controller.rb

SELECT "heros".* FROM "heros"
---
    def index
        heros = Hero.all

SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        hero = Hero.find_by(id: params[:id])