app/controllers/powers_controller.rb

    def index
        render json: Power.all, status: :ok
---
SELECT "powers".* FROM "powers"

    def show
        power = Power.find_by(id: params[:id])
---
SELECT "powers".* FROM "powers" WHERE "powers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]